_orgs/_posts/_site/php/2015-08-20-php-import-export.org
#+TITLE:     PHP 导入导出
#+AUTHOR:    Rengui Zhao
#+EMAIL:     zrg1390556487@gmail.com
#+LANGUAGE:  cn
#+OPTIONS:   H:3 num:t toc:nil \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:plain toc:t ltoc:t mouse:underline buttons:0 path:http://cs3.swfc.edu.cn/~20121156044/.org-info.js />
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://cs3.swfu.edu.cn/~20121156044/.org-manual.css" />
#+HTML_HEAD: <style>body {font-size:14pt} code {font-weight:bold;font-size:100%; color:darkblue}</style>
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT: 

#+BEGIN_EXPORT HTML
---
layout: post
title: PHP 导入导出
author: zrg
comments: false
description: PHP 实现导入导出
categories:
- php
tags:
- PHP-导入导出
photos:
---
#+END_EXPORT

# (setq org-export-html-use-infojs nil)
# (setq org-export-html-style nil)

* 数据导入导出
** 导入
: 待更新
** 一般导出
*** 核心代码
#+BEGIN_SRC emacs-lisp
header("Content-Type: application/vnd.ms-excel; charset=UTF-8"); 
header("Pragma: public"); 
header("Expires: 0"); 
header("Cache-Control: must-revalidate, post-check=0, pre-check=0"); 
header("Content-Type: application/force-download"); 
header("Content-Type: application/octet-stream"); 
header("Content-Type: application/download"); 
header("Content-Disposition: attachment;filename=".$title .".xls "); 
header("Content-Transfer-Encoding: binary ");
#+END_SRC
** 使用 PHPExcel
*** 下载
: https://github.com/PHPOffice/PHPExcel
*** 开始
#+BEGIN_SRC emacs-lisp
// 导入PHPExcel.php或者其他文件
require_once 'PHPExcel.php';
// 创建一个处理对象实例 
$objExcel = new PHPExcel();
// 获取属性
$objProps = $objExcel->getProperties ();
//设置创建者
$objProps->setCreator ( 'XuLulu');
//设置最后修改者
$objProps->setLastModifiedBy("XuLulu");
//描述
$objProps->setDescription("摩比班级");
//设置标题
$objProps->setTitle ( '管理器' );
//设置题目
$objProps->setSubject("OfficeXLS Test Document, Demo");
//设置关键字
$objProps->setKeywords ( '管理器' );
//设置分类
$objProps->setCategory ( "Test");
//工作表设置
$objExcel->setActiveSheetIndex( 0 );
$objActSheet = $objExcel->getActiveSheet ();
//单元格赋值   例：
$objActSheet->setCellValue ( 'A1', 'ID');
$objActSheet->setCellValue ( 'B1', 'HashCode');
$objActSheet->setCellValue ( 'C1', 'ModelName');
$objActSheet->setCellValue ( 'D1', 'IndexName');
$objActSheet->setCellValue('A1', '字符串内容');  // 字符串内容  
$objActSheet->setCellValue('A2', 26);            // 数值  
$objActSheet->setCellValue('A3', true);          // 布尔值
$objActSheet->setCellValue('A4', '=SUM(A2:A2)'); // 公式
//自动设置单元格宽度   例：
$objActSheet->getColumnDimension('A')->setAutoSize(true);
//手动设置单元格的宽度   例：
//$objActSheet->getColumnDimension('A')->setWidth(10);
//导出的文件名
$outputFileName = iconv ( 'UTF-8', 'gb2312', 'XuLulu_'. time() . '.xlsx' );
//直接导出文件
$objWriter->save ( $outputFileName );
//文件直接输出到浏览器
header ( 'Pragma:public');
header ( 'Expires:0');
header ( 'Cache-Control:must-revalidate,post-check=0,pre-check=0');
header ( 'Content-Type:application/force-download');
header ( 'Content-Type:application/vnd.ms-excel');
header ( 'Content-Type:application/octet-stream');
header ( 'Content-Type:application/download');
header ( 'Content-Disposition:attachment;filename='. $outputFileName );
header ( 'Content-Transfer-Encoding:binary');
$objWriter->save ( 'php://output');
其他设置：
//显式指定内容类型  
$objActSheet->setCellValueExplicit('A5','847475847857487584',
PHPExcel_Cell_DataType::TYPE_STRING);  
//合并单元格  
$objActSheet->mergeCells('B1:C22');  
//分离单元格  
$objActSheet->unmergeCells('B1:C22');
//得到单元格的样式
$objStyleA5 = $objActSheet->getStyle('A5');
//设置字体  
$objFontA5 = $objStyleA5->getFont();  
$objFontA5->setName('Courier New');  
$objFontA5->setSize(10);  
$objFontA5->setBold(true);  
$objFontA5->setUnderline(PHPExcel_Style_Font::UNDERLINE_SINGLE);  
$objFontA5->getColor()->setARGB('FF999999');  
//设置对齐方式
$objAlignA5 = $objStyleA5->getAlignment();  
$objAlignA5->setHorizontal(PHPExcel_Style_Alignment::HORIZONTAL_RIGHT);  
$objAlignA5->setVertical(PHPExcel_Style_Alignment::VERTICAL_CENTER);
//设置边框  
$objBorderA5 = $objStyleA5->getBorders();  
$objBorderA5->getTop()->setBorderStyle(PHPExcel_Style_Border::BORDER_THIN);  
$objBorderA5->getTop()->getColor()->setARGB('FFFF0000');// color  
$objBorderA5->getBottom()->setBorderStyle(PHPExcel_Style_Border::BORDER_THIN);  
$objBorderA5->getLeft()->setBorderStyle(PHPExcel_Style_Border::BORDER_THIN);  
$objBorderA5->getRight()->setBorderStyle(PHPExcel_Style_Border::BORDER_THIN);  
//设置填充颜色  
$objFillA5 = $objStyleA5->getFill();  
$objFillA5->setFillType(PHPExcel_Style_Fill::FILL_SOLID);  
$objFillA5->getStartColor()->setARGB('FFEEEEEE');  
//从指定的单元格复制样式信息.  
$objActSheet->duplicateStyle($objStyleA5,'B1:C22');  
//*************************************  
//添加图片  
$objDrawing = new PHPExcel_Worksheet_Drawing();  
$objDrawing->setName('ZealImg');  
$objDrawing->setDescription('Image inserted byZeal');  
$objDrawing->setPath('./zeali.net.logo.gif');  
$objDrawing->setHeight(36);  
$objDrawing->setCoordinates('C23');  
$objDrawing->setOffsetX(10);  
$objDrawing->setRotation(15);  
$objDrawing->getShadow()->setVisible(true);  
$objDrawing->getShadow()->setDirection(36);  
$objDrawing->setWorksheet($objActSheet);  
//添加一个新的worksheet  
$objExcel->createSheet();  
$objExcel->getSheet(1)->setTitle('测试2');  
//保护单元格  
$objExcel->getSheet(1)->getProtection()->setSheet(true);  
$objExcel->getSheet(1)->protectCells('A1:C22','PHPExcel');
#+END_SRC
*** 一个简单示例
**** conn.php文件
#+BEGIN_SRC sh emacs-lisp
<?php
$conn = array(
'host' =>'127.0.0.1' ,
'user_name' => 'root',
'password' => '',
'db_name' => 'test',
"charset"=>"utf8"
);
?>
#+END_SRC
**** data.php
#+BEGIN_SRC sh emacs-lisp
<?php
require dirname(__FILE__).'\conn.php';
class data{
public $conn=null;
public function __construct($config){ //构造方法，实例化类自动调用
$this->conn=mysqli_connect($config['host'],$config['user_name'],$config['password'],$config['db_name']) or die(mysql_error());
mysqli_query($this->conn,"set names utf8");
// mysqli_query($conn,'set names'.$config['charset']) or die(mysql_error());
}
/**
 * 根据传入的sql语句 查询mysql结果集
    * @param  [type] $sql [description]
       * @return [type]      [description]
	  */
	  public function getResult($sql){
	  $resource=mysqli_query($this->conn,$sql) or die(mysql_error());
	  $res=array();
	  while (($row=mysqli_fetch_assoc($resource))!=false) {
	  $res[]=$row;
	  }
	  return $res;
	  }
	  public function getData($value)
	  {
	  $sql="SELECT * FROM user";
	  $res=self::getResult($sql);
	  return $res;
	  }
}
#+END_SRC
**** export.php
#+BEGIN_SRC sh emacs-lisp
<?php
$dir=dirname(__FILE__);
require $dir.'\data.php';
require $dir.'\PHPExcel\PHPExcel.php';

$db=new data($conn);
$objPHPExcel=new PHPExcel();
for ($i=1; $i < 3; $i++) {
if ($i>1) {
$objPHPExcel->createSheet();
}
$objPHPExcel->setActiveSheetIndex($i-1);
$objSheet=$objPHPExcel->getActiveSheet();
$data=$db->getData($i);

$objSheet->setCellValue("A1","姓名")->setCellValue('B1','年龄');
$j=2;
foreach ($data as $key => $value) {
// $name = iconv('utf-8', 'gb2312', $value['name']);
// $age = iconv('utf-8', 'gb2312', $value['age']);
// echo $value['name'];
$objSheet->setCellValue('A'.$j,$name)->setCellValue('B'.$j,$value['age'].'岁');
$j++;
}
}
$objWriter=PHPExcel_IOFactory::createWriter($objPHPExcel,'Excel2007');
browser_export('Excel7','example.xls');
$objWriter->save('php://output');

function browser_export($type,$filename){
if ($type='Excel5') {
header('Content-Type: application/vnd.ms-excel');  //excel5
}else{
header('Content-Type: application/vnd.openxmlformats-officedocument.spreadsheetml.sheet'); //excel7
}
header('Content-Disposition: attachment;filename="'.$filename.'"');
header('Cache-Control: max-age=0');
}
// $objWriter->save($dir.'\export_1.xls');
?>
#+END_SRC

** References
: https://www.the-art-of-web.com/php/dataexport/

